In [3]:
import pandas as pd
import database_utils as dbu

# 1. Test products table

In [5]:
query = '''
    select * 
    from products
    limit 3
'''

sample_products = dbu.query_sql(sql=query, database='supermarket.db')
sample_products

Query executed successfully!
query returned 3 rows

         0     1       2
0  chicken  meat  5500.0
1     beef  meat  5000.0
2     pork  meat  4000.0

# 2. Test transactions table

In [6]:
query = '''
    select * 
    from transactions
    limit 3
'''

sample_transactions = dbu.query_sql(sql=query, database='supermarket.db')
sample_transactions

Query executed successfully!
query returned 3 rows

                     0                  1     2           3
0  2021-03-01 09:00:00            oranges  29.0  location_1
1  2021-03-01 09:00:00  laundry detergent   6.0  location_1
2  2021-03-01 09:00:00            shampoo   4.0  location_1

# 3. Test Prices table

In [7]:
query = '''
    select * 
    from prices
    limit 3
'''

sample_prices = dbu.query_sql(sql=query, database='supermarket.db')
sample_prices

Query executed successfully!
query returned 3 rows

            0       1       2
0  location_1  coffee   289.0
1  location_1     tea   538.0
2  location_1    soda  1811.0